tutorials/Sun/initial_1D_profile/1DSedim/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          200;
        startFace       199;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          200;
        startFace       399;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       599;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       600;
    }
    backPlane
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       601;
    }
    frontPlane
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       801;
    }
)

// ************************************************************************* //
